//==================================================================================================
// 文件：DebugCmd.h
// 作者：顾宇浩
// 简介：调试指令类接口
// 上次修改：2020-6-16 (v1.0.0)
//==================================================================================================

#pragma once
#include "DebugIoStream.h"



//==================================================================================================
// 类名：DebugCmd（纯虚）
// 说明：
//		调试指令类纯虚接口，用户的指令应当继承此类以符合接口。
//		指令的operator()函数没有接受DebugServer的引用，是因为在这个调试服务器模型中的指令不是调试服务器
//		敏感的，也就是说，指令不应该因为哪个服务器调用它而效果有所不同。
//==================================================================================================
class DebugCmd
{
public:
	virtual ~DebugCmd() {};

	//==============================================================================================
	// 函数：info
	// 参数：无
	// 返回：存放详情信息的C字符串
	// 说明：这个函数返回命令的详情信息
	//==============================================================================================
	virtual const char* info() = 0;

	//==============================================================================================
	// 函数：operator()
	// 参数：
	//		in - 参数输入流
	//		out - 命令使用的输出流
	//
	// 返回：终止标志，返回true表示调试服务器继续运行，false表示终止主循环。
	// 说明：使用in读入命令的附加参数，使用out输出命令想打印的信息
	//==============================================================================================
	virtual bool operator()(ICharStream& in, OCharStream out) = 0;
};
